Show / Hide Table of Contents
Class SteelSetupAUS
Steel setup IBC class
Inheritance
System.Object
SteelSetup
SteelSetupAUS
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SteelSetupAUS : SteelSetup
Properties
Improve this Doc   View Source
Anchor_Fiar
Safety factor Anchor_Fiar
Declaration
public double Anchor_Fiar { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Bolt_Fib
Safety factor Bolt_Fib
Declaration
public double Bolt_Fib { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Bolt_Fip
Safety factor preloaded bolt
Declaration
public double Bolt_Fip { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CrtBearing
Concrete bearing factor
Declaration
public double CrtBearing { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Structural_Fi
Safety factor Structural_Fi
Declaration
public double Structural_Fi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Weld_Fiw
Safety factor Weld_Fiw
Declaration
public double Weld_Fiw { get; set; }
Property Value
 Type |  Description
 System.Double
Methods
Improve this Doc   View Source
FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
Declaration
public override double FrictionCoefficientPboltDefault()
Returns
 Type |  Description
 System.Double
Overrides
SteelSetup.FrictionCoefficientPboltDefault()
 Improve this Doc
 View Source